import React, { FC } from 'react';
import { Collapse } from 'antd';

import faq from '../../Assets/Images/faq.png';

import styles from './faq-section.module.scss';
import Button from '../Button/Button';
import { ROUTES } from '../Constants/Routes/routes';

interface IFAQ {
  id: string;
  question: string;
  answer: string;
}

const { Panel } = Collapse;
const FaqSection: FC = () => {
  return (
    <section className={styles.faqSection}>
      <div className={styles.faqSection__box}>
        <div className={styles.faqSection__answer}>
          <h2 className={styles.faqSection__title}>
            Відповідаємо на часті запитання
          </h2>
          <Button
            modificator={'main__free'}
            route={ROUTES.CONTACTS}
            children={'Задати питання'}
          />
        </div>
        <div className={styles.faqSection__img}>
          <img src={faq} alt='questionMark' />
        </div>
      </div>
      <div className={styles.faqSection__collapse}>
        <Collapse bordered={false} defaultActiveKey={['1']}>
          {FAQ.map(({ answer, id, question }) => (
            <Panel header={question} key={id}>
              {answer}
            </Panel>
          ))}
        </Collapse>
      </div>
    </section>
  );
};

const FAQ: IFAQ[] = [
  {
    id: '1',
    question: 'Як відбувається навчання на онлайн-курсах?',
    answer:
      'Навчання відбувається у форматі відео-лекцій на нашій інтерактивній платформі. Після придбання курсу, ви відразу отримуєте листа на пошту з доступом до особистого кабінету, в якому вже відкрито всі уроки придбаного курсу. Кожен урок складається з відео-лекції з теми та кількох десятків інтерактивних завдань на відпрацювання матеріалу.',
  },
  {
    id: '2',
    question: 'Я купую пакет уроків чи онлайн-курс, скільки він діє?',
    answer:
      'Навчання відбувається у форматі відео-лекцій на нашій інтерактивній платформі. Після придбання курсу, ви відразу отримуєте листа на пошту з доступом до особистого кабінету, в якому вже відкрито всі уроки придбаного курсу. Кожен урок складається з відео-лекції з теми та кількох десятків інтерактивних завдань на відпрацювання матеріалу.',
  },
  {
    id: '3',
    question: 'Як швидко я досягну результатів?',
    answer:
      'Навчання відбувається у форматі відео-лекцій на нашій інтерактивній платформі. Після придбання курсу, ви відразу отримуєте листа на пошту з доступом до особистого кабінету, в якому вже відкрито всі уроки придбаного курсу. Кожен урок складається з відео-лекції з теми та кількох десятків інтерактивних завдань на відпрацювання матеріалу.',
  },
  {
    id: '4',
    question: 'Коли я можу розпочати навчання?',
    answer:
      'Навчання відбувається у форматі відео-лекцій на нашій інтерактивній платформі. Після придбання курсу, ви відразу отримуєте листа на пошту з доступом до особистого кабінету, в якому вже відкрито всі уроки придбаного курсу. Кожен урок складається з відео-лекції з теми та кількох десятків інтерактивних завдань на відпрацювання матеріалу.',
  },
  {
    id: '5',
    question: 'Як відбувається навчання на індивідуальних заняттях?',
    answer:
      'Навчання відбувається у форматі відео-лекцій на нашій інтерактивній платформі. Після придбання курсу, ви відразу отримуєте листа на пошту з доступом до особистого кабінету, в якому вже відкрито всі уроки придбаного курсу. Кожен урок складається з відео-лекції з теми та кількох десятків інтерактивних завдань на відпрацювання матеріалу.',
  },
];

export default FaqSection;
