export const ua = {
  // right
  rights: 'Всі права захищені',
  // general
  warning: 'Завантажую дані почекайте..',
  courseWarning: 'Вибачте сервер збожеволів.',
  wait: 'Очікуйте будь-ласка.',
  //
  courses: 'Курси',
  aboutUs: 'Про нас',
  contacts: 'Контакти',
  faq: 'Запитання й відповіді',
  proposals: 'Пропозиції',
  support: 'Служба підтримки',
  also: 'Також',
  logout: 'Вийти',
  signIn: 'Увійти',
  // tabs breadcrumb
  about: 'Про нас',
  'elementary English': 'Англійська для початкового рівня',
  'intermediate English': 'Англійська для середнього рівня',
  'advanced English': 'Англійська для високого рівня',

  'elementary German': 'Німецька для початкового рівня',
  'intermediate German': 'Німецька для середнього рівня',
  'advanced German': 'Німецька для високого рівня',

  'elementary Spain': 'Іспанська для початкового рівня',
  'intermediate Spain': 'Іспанська для середнього рівня',
  'advanced Spain': 'Іспанська для високого рівня',

  'elementary China': 'Китайська для початкового рівня',
  'intermediate China': 'Китайська для середнього рівня',
  'advanced China': 'Китайська для високого рівня',

  // reverse named
  'Англійська для початкового рівня': 'Англійська для початкового рівня',
  'Англійська для середнього рівня': 'Англійська для середнього рівня',
  'Англійська для високого рівня': 'Англійська для високого рівня',

  'Німецька для початкового рівня': 'Німецька для початкового рівня',
  'Німецька для середнього рівня': 'Німецька для середнього рівня',
  'Німецька для високого рівня': 'Німецька для високого рівня',

  'Іспанська для початкового рівня': 'Іспанська для початкового рівня',
  'Іспанська для середнього рівня': 'Іспанська для середнього рівня',
  'Іспанська для високого рівня': 'Іспанська для високого рівня',

  'Китайська для початкового рівня': 'Китайська для початкового рівня',
  'Китайська для середнього рівня': 'Китайська для середнього рівня',
  'Китайська для високого рівня': 'Китайська для високого рівня',

  FAQ: 'Запитання й відповіді',
  suggestions: 'Пропозиції',
  login: 'Увійти',
  registration: 'Реєстрація',
  admin: 'Адмін',
  personal: 'Особистий кабінет',
  reviews: 'Відгуки',
  payment: 'Умови оплати',
  policy: 'Політика',
  useragreement: 'Угода',
  //   Home page
  homeTitle: 'Онлайн-школа іноземних мов',
  homeSubTitle: 'Досягни своєї мети за допомогою кращих методик від носіів мов',
  tryToFree: 'Спробувати безкоштовно',
  homeCourseTitle: ' Курси іноземної мови для будь-якого рівня',
  homeCourseLessons: 'Занять',
  homeCourseModules: 'Модулей',
  'Дізнатись детальніше': 'Дізнатись детальніше',
  priceFrom: 'Від',
  uah: 'грн',
  allCourses: 'Всі курси',
  price: 'Вартість',
  //  Home page  forWhomSection
  forWhom: 'Кому підійде?',
  forWhomSubtitle: ` підійде всім, хто
  хоче за короткий термін якісно змінити своє життя, освоївши іноземну
  мову.`,
  schoolchildren: 'Школярам',
  schoolchildrenDesc: 'Скласти випускні іспити або вступити до ВНЗ.',

  students: 'Студентам',
  studentsDesc:
    'Переїхати на навчання в іншу країну або знайти високооплачувану роботу',

  emigrant: 'Емігрантам',
  emigrantDesc:
    'Адаптуватися в новій країні, створити конкурентну перевагу та працевлаштуватися',

  comunicative: 'Комунікабельним',
  comunicativeDesc: `Створити щасливу сім'ю з іноземцем і інтегруватися в нове суспільство`,

  buisnes: 'Бізнесменам',
  buisnesDesc:
    'Завести полезные знакомства среди иностранцев и масштабировать бизнес',

  travel: 'Мандрівникам',
  travelDesc:
    'Вільно спілкуватися та знаходити нових друзів, вирішувати побутові питання та спірні ситуації',
  // Home page methodology section
  methodologyTitle: 'Ефективна методика вивчення мови з',
  methodologyListFirst:
    'Самостійно вибираєте зручний режим та час проходження завдань',
  methodologyListSecond:
    'Сучасна ефективна методика навчання гарантує освоєння мови на максимально високому рівні за короткий термін',
  methodologyListThird:
    'Повна автоматизація дозволяє нам надавати найнижчу ціну - у 2, 3, а то й у 5 разів дешевше за інші мовні школи.',
  // Home page (How it works section)
  howItWorksTitle: 'Як це працює ?',
  choice: 'Вибір курсу',
  choiceDesc: `Вибирайте потрібний мовний курс, aбо отримайте безкоштовний урок.`,

  afterRegistration: 'Після вибору потрібного курсу пройдіть Реєстрацію',
  study: 'Навчання',
  studyDesc:
    'Все. У вашому особистому кабінеті буде відкритий доступ до курсу.',
  // FIRST LESSON GENERAL SECTION
  freeLessonTitle: `Безкоштовний урок від Lang4U. Вкажіть свою пошту і ми надішлемо
  деталі.`,
  email: 'Пошта',
  emailPlaceholder: 'Ваша пошта',
  freeLessonBtn: 'Відправити',
  agreement: 'Надсилаючи заявку, я погоджуюсь з',
  politic: 'політикою конфіденційності',
  userAgreementLink: 'користувальницькою угодою',
  and: 'та',
  //   free lesson validation
  "Пошта обов'язкове поле": "Пошта обов'язкове поле",
  'Приклад: jimmy@gmail.com': 'Приклад: jimmy@gmail.com',
  'Мінімум 4 символи': 'Мінімум 4 символи',
  'Максимум 30 символів': 'Максимум 30 символів',
  "Обов'язковий маркер": "Обов'язковий маркер",
  //FAQ SECTION
  faqTitle: 'Відповідаємо на часті запитання',
  ask: 'Задати питання',
  questionFirst: 'Як відбувається навчання на онлайн-курсах?',
  answerFirst:
    'Навчання відбувається у форматі відео-лекцій на нашій інтерактивній платформі. Після придбання курсу, ви відразу отримуєте листа на пошту з доступом до особистого кабінету, в якому вже відкрито всі уроки придбаного курсу. Кожен урок складається з відео-лекції з теми та кількох десятків інтерактивних завдань на відпрацювання матеріалу.',
  questionSecond: 'Я купую пакет уроків чи онлайн-курс, скільки він діє?',
  questionThird: 'Як швидко я досягну результатів?',
  questionFour: 'Коли я можу розпочати навчання?',
  questionFive: 'Як відбувається навчання на індивідуальних заняттях?',
  // footer
  footerTitle: `Lang4U - інтерактивна платформа для легкого, зручного та швидкого
вивчення іноземних мов.`,
  info: 'Інформація',
  //   COURSES PAGE
  Всі: 'Всі',
  Англійська: 'Англійська',
  Німецька: 'Німецька',
  Іспанська: 'Іспанська',
  Китайська: 'Китайська',
  //   ABOUT US PAGE
  aboutSubtitle: 'Говори легко – живи вільно!',
  aboutFirstTitle: 'інтерактивна онлайн-школа іноземних мов',
  aboutFirstDesc: `Це нова повністю автоматизована платформа, яка допоможе вам прокачати мову для роботи, навчання або спілкування.
  Наша система дозволить вам у динамічній ігровій формі опанувати іноземну мову, вільно мислити та говорити, будувати пропозиції, підтримувати розмову в будь-якому суспільстві та у будь-якій життєвій ситуації.`,
  aboutSecondTitle: `Для тих, хто сам хоче будувати своє життя і прагне мрії!`,
  aboutSecondDesc:
    'Наша школа підійде для школярів та студентів, бізнесменів та мандрівників, амбітних підприємців та винахідливих емігрантів. Ми дамо вам основи та міцні знання іноземних мов за короткий час та у зручному місці.',
  aboutThirdTitle: 'відрізняється від класичних курсів вивчення мови',
  aboutThirdDesc:
    'Це зрозуміла, не нудна та повністю інтерактивна система! Ви самі вибираєте де, як і скільки займатись. Вона підійде всім, хто хоче за короткий термін якісно змінити своє життя, всім, хто готовий шукати нові можливості з новою мовою!',
  teacherTitle: 'Курси створили професійні філологи та педагоги',
  teacherSubtitle: `Носії мови, викладачі зарубіжних університетів, які багато років
  працюють у тому числі і в Україні, володіють методиками викладання
  своєї мови, як іноземної та чудово знають нюанси викладання саме в
  українському середовищі.`,
  engTeacher: 'Викладач Англійської',
  germanTeacher: 'Викладач Німецької',
  spainTeacher: 'Викладач Іспанської',
  chinaTeacher: 'Викладач Китайської',
  //   CONTACTS PAGE
  contactsSubtitle: `Ми на зв'язку у будь-який зручний час`,
  onThePhone: 'За телефоном',
  onEmail: 'За електронною адресою',
  onMessengers: 'В соцмережах',
  help: 'Потрібна допомога із вибором курсу?',
  helpSubtitle: 'Залишіть заявку і ми підберемо індивідуальне рішення',
  supportName: `Ім'я`,
  supportNamePlaceholder: `Ваше ім'я`,
  supportEmailPlaceholder: 'Ваша пошта',
  supportMessage: 'Повідомлення',
  supportMessageDesc: `(не обов'язково)`,
  supportMessagePlaceholder: 'Ваше питання',
  leaveRequest: 'Залишити заявку',
  // support contacts form validation
  'Максимум 25 символів': 'Максимум 25 символів',
  'Цифри від 6 до 99': 'Цифри від 6 до 99',
  'Максимум 2 символів': 'Максимум 2 символів',
  'Мінімум 2 символи': 'Мінімум 2 символи',
  'Максимум 15 символів': 'Максимум 15 символів',
  "Ім'я обов'язкове поле": "Ім'я обов'язкове поле",
  'Тільки Укр та Англ букви': 'Тільки Укр та Англ букви',
  //   SUPPORT PAGE
  supportSubtitle: `Якщо у вас виникли труднощі по роботі сайту, складності в оплаті
  або є питання, ви можете звернутися в службу підтримки, ми
  обов'язково вам допоможемо.`,
  supportInfo: 'Загальна інформація',
  supportText: `Ясність нашої позиції очевидна: консультація з широким активом
  однозначно визначає кожного учасника як здатного приймати власні
  рішення щодо прогресу професійної спільноти. Як уже неодноразово
  згадано, зроблені на базі інтернет-аналітики висновки закликають
  нас до нових звершень, які, у свою чергу, мають бути об'єднані у
  цілі кластери собі подібних. Будучи лише частиною загальної
  картини, явні ознаки перемоги інституціоналізації піддані цілій
  серії незалежних досліджень.`,
  supportWrite: 'Написати до служби підтримки',
  supportRequest: 'Залишіть заявку і ми постараємося вам допомогти',

  //   FAQ PAGE
  faqSubtitle: 'Поширені запитання',
  faqBoxTitle: 'Ми завжди раді допомогти!',
  faqBoxContact:
    'Звертайтеся до нашої команди підтримки студентів з будь-яких питань.',
  faqSendQuestion: 'Задати питання',

  //   SUGGESTIONS (PROPOSALS) PAGE
  suggestionTitle: 'Пропозиції щодо роботи сайту',
  suggestionSubtitle: `Ми завжди готові ставати кращими! Є пропозиції щодо покращення роботи
  сайту? Напишіть нам`,
  suggestionHere: 'Тут ми збираємо пропозиції щодо покращення Lang4U.',
  suggestionIfProblem: `Якщо ви зіткнулися з технічними труднощами, зв'яжіться з підтримкою`,
  suggestionWishes: 'Побажання щодо розвитку Lang4U можна залишити тут.',
  suggestionWishesCourse: `Побажання щодо додавання на Lang4U курсів, матеріалів, статей можна
  залишити тут.`,

  //   LOGIN REGISTRATION
  loginTitle: 'Вхід до кабінету',
  authError: 'Помилка, спробуйте ще раз.',
  'Тільки англійські букви та цифри': 'Тільки англійські букви та цифри',
  'Підтвердіть пароль': 'Підтвердіть пароль',
  "Пароль обов'язкове поле": "Пароль обов'язкове поле",
  password: 'Пароль',
  noAcc: 'Немає аккаунту ?',
  signUp: 'Зареєструватися',
  confirmPassword: 'Підтвердити пароль',
  accExist: 'Вже є аккаунт ?',
  //
  // ADMIN AND USER PANEL
  adminTitle: 'Панель Адміністратора',
  userMainPage: 'Головна',
  userSettings: 'Налаштування',
  greeting: 'Ласкаво просимо до',
  achieveTitle: `Досягайте своїх цілей за допомогою авторських ігрових методик від
  носіїв мови`,
  lessons: 'Заняття',
  teacherLesson: `Заняття з викладачем відбувається індивідуально. Викладач сам визначає
  час проведення та інформує про це студента за 5 днів.`,
  homework: 'Домашка',
  additional: 'Доповнення',
  noOneCourse: 'У вас поки що немає курсів',
  toTheCourses: 'До курсів',
  yoursCourse: 'Ваші курси',
  surname: 'Фамілія',
  age: 'Ваш вік',
  city: 'Місто',
  update: 'Оновити',
  personalData: 'Особисті дані',

  //   COURSE ITEM PAGE
  tasks: 'Завдань',
  tests: 'Тестів',
  lessonsWithExpert: 'Занять із експертом',
  courseAlreadyExist: 'Ви вже маєте такий курс',
  successAdd: 'Успіх. Курс додано в особистий кабінет.',
  addCourse: 'Додати курс в ОК',
  signUpForACourse: 'Записатися на курс',
  similarCourses: 'Схожі курси',
  aboutCourse: 'Про курс',
  afterCourse: 'Після проходження курсу:',
  share: 'Поділитися:',
  afterCourseFirst: 'легко розповісте про себе, уявіть свою компанію',
  afterCourseSecond:
    'зможете підтримати розмову і легко орієнтуватися в побутових ситуаціях',
  afterCourseThird: 'легко знайомитися та спілкуватися з оточуючими',
  afterCourseFour: 'Ви ніколи не загубитеся в мовному середовищі!',
  whyFastTitle: 'Чому ви швидко освоїте мову',
  interestingLesson: 'Цікаві уроки',
  interestingLessonDesc: `Короткі, але насичені уроки до 45 хвилин.
  Глибокіший обсяг знань, ніж в інших школах і навіть чим передбачено міжнародними стандартами.`,
  goodFormat: 'Зручний формат навчання',
  goodFormatDesc:
    'Цілком автоматичний процес навчання на одній платформі з доступом на будь-якому пристрої.',
  'Для початкового рівня': 'Для початкового рівня',
  'Для середнього рівня': 'Для середнього рівня',
  'Для високого рівня': 'Для високого рівня',
};
