export const ua = {
  // right
  rights: 'Всі права захищені',
  // general
  warning: 'Завантажую дані почекайте..',
  courseWarning: 'Вибачте сервер збожеволів.',
  wait: 'Очікуйте будь-ласка.',
  //
  courses: 'Курси',
  aboutUs: 'Про нас',
  contacts: 'Контакти',
  faq: 'Запитання й відповіді',
  proposals: 'Пропозиції',
  support: 'Підтримка',
  also: 'Також',
  logout: 'Вийти',
  signIn: 'Увійти',
  // tabs breadcrumb
  about: 'Про нас',
  'elementary English': 'Англійська для початкового рівня',
  'intermediate English': 'Англійська для середнього рівня',
  'advanced English': 'Англійська для високого рівня',

  'elementary German': 'Німецька для початкового рівня',
  'intermediate German': 'Німецька для середнього рівня',
  'advanced German': 'Німецька для високого рівня',

  'elementary Spain': 'Іспанська для початкового рівня',
  'intermediate Spain': 'Іспанська для середнього рівня',
  'advanced Spain': 'Іспанська для високого рівня',

  'elementary China': 'Китайська для початкового рівня',
  'intermediate China': 'Китайська для середнього рівня',
  'advanced China': 'Китайська для високого рівня',

  // reverse named
  'Англійська для початкового рівня': 'Англійська для початкового рівня',
  'Англійська для середнього рівня': 'Англійська для середнього рівня',
  'Англійська для високого рівня': 'Англійська для високого рівня',

  'Німецька для початкового рівня': 'Німецька для початкового рівня',
  'Німецька для середнього рівня': 'Німецька для середнього рівня',
  'Німецька для високого рівня': 'Німецька для високого рівня',

  'Іспанська для початкового рівня': 'Іспанська для початкового рівня',
  'Іспанська для середнього рівня': 'Іспанська для середнього рівня',
  'Іспанська для високого рівня': 'Іспанська для високого рівня',

  'Китайська для початкового рівня': 'Китайська для початкового рівня',
  'Китайська для середнього рівня': 'Китайська для середнього рівня',
  'Китайська для високого рівня': 'Китайська для високого рівня',

  FAQ: 'Запитання й відповіді',
  suggestions: 'Пропозиції',
  login: 'Увійти',
  registration: 'Реєстрація',
  admin: 'Адмін',
  personal: 'Особистий кабінет',
  reviews: 'Відгуки',
  payment: 'Умови оплати',
  policy: 'Політика',
  useragreement: 'Угода',
  //   Home page
  homeTitle: 'Онлайн-школа іноземних мов',
  homeSubTitle: 'Досягни своєї мети за допомогою кращих методик від носіів мов',
  tryToFree: 'Спробувати безкоштовно',
  homeCourseTitle: ' Курси іноземної мови для будь-якого рівня',
  homeCourseLessons: 'Занять:',
  homeCourseModules: 'Модулей:',
  'Дізнатись детальніше': 'Дізнатись детальніше',
  priceFrom: 'Від',
  uah: 'грн',
  allCourses: 'Всі курси',
  //  Home page  forWhomSection
  forWhom: 'Кому підійде?',
  forWhomSubtitle: ` підійде всім, хто
  хоче за короткий термін якісно змінити своє життя, освоївши іноземну
  мову.`,
  schoolchildren: 'Школярам',
  schoolchildrenDesc: 'Скласти випускні іспити або вступити до ВНЗ.',

  students: 'Студентам',
  studentsDesc:
    'Переїхати на навчання в іншу країну або знайти високооплачувану роботу',

  emigrant: 'Емігрантам',
  emigrantDesc:
    'Адаптуватися в новій країні, створити конкурентну перевагу та працевлаштуватися',

  comunicative: 'Комунікабельним',
  comunicativeDesc: `Створити щасливу сім'ю з іноземцем і інтегруватися в нове суспільство`,

  buisnes: 'Бізнесменам',
  buisnesDesc:
    'Завести полезные знакомства среди иностранцев и масштабировать бизнес',

  travel: 'Мандрівникам',
  travelDesc:
    'Вільно спілкуватися та знаходити нових друзів, вирішувати побутові питання та спірні ситуації',
  // Home page methodology section
  methodologyTitle: 'Ефективна методика вивчення мови з',
  methodologyListFirst:
    'Самостійно вибираєте зручний режим та час проходження завдань',
  methodologyListSecond:
    'Сучасна ефективна методика навчання гарантує освоєння мови на максимально високому рівні за короткий термін',
  methodologyListThird:
    'Повна автоматизація дозволяє нам надавати найнижчу ціну - у 2, 3, а то й у 5 разів дешевше за інші мовні школи.',
  // Home page (How it works section)
  howItWorksTitle: 'Як це працює ?',
  choice: 'Вибір курсу',
  choiceDesc: `Вибирайте потрібний мовний курс, aбо отримайте безкоштовний урок.`,

  afterRegistration: 'Після вибору потрібного курсу пройдіть Реєстрацію',
  study: 'Навчання',
  studyDesc:
    'Все. У вашому особистому кабінеті буде відкритий доступ до курсу.',
  // FIRST LESSON GENERAL SECTION
  freeLessonTitle: `Безкоштовний урок від Lang4U. Вкажіть свою пошту і ми надішлемо
  деталі.`,
  email: 'Пошта',
  emailPlaceholder: 'Ваша пошта',
  freeLessonBtn: 'Відправити',
  agreement: 'Надсилаючи заявку, я погоджуюсь з',
  politic: 'політикою конфіденційності',
  userAgreementLink: 'користувальницькою угодою',
  and: 'та',
  //   free lesson validation
  "Пошта обов'язкове поле": "Пошта обов'язкове поле",
  'Приклад: jimmy@gmail.com': 'Приклад: jimmy@gmail.com',
  'Мінімум 4 символи': 'Мінімум 4 символи',
  'Максимум 30 символів': 'Максимум 30 символів',
  "Обов'язковий маркер": "Обов'язковий маркер",
  //FAQ SECTION
  faqTitle: 'Відповідаємо на часті запитання',
  ask: 'Задати питання',
  questionFirst: 'Як відбувається навчання на онлайн-курсах?',
  answerFirst:
    'Навчання відбувається у форматі відео-лекцій на нашій інтерактивній платформі. Після придбання курсу, ви відразу отримуєте листа на пошту з доступом до особистого кабінету, в якому вже відкрито всі уроки придбаного курсу. Кожен урок складається з відео-лекції з теми та кількох десятків інтерактивних завдань на відпрацювання матеріалу.',
  questionSecond: 'Я купую пакет уроків чи онлайн-курс, скільки він діє?',
  questionThird: 'Як швидко я досягну результатів?',
  questionFour: 'Коли я можу розпочати навчання?',
  questionFive: 'Як відбувається навчання на індивідуальних заняттях?',
  // footer
  footerTitle: `Lang4U - інтерактивна платформа для легкого, зручного та швидкого
вивчення іноземних мов.`,
  info: 'Інформація',
  //   COURSES PAGE
  Всі: 'Всі',
  Англійська: 'Англійська',
  Німецька: 'Німецька',
  Іспанська: 'Іспанська',
  Китайська: 'Китайська',
};
