export const ua = {
  // general
  warning: 'Завантажую дані почекайте..',
  courseWarning: 'Вибачте сервер збожеволів.',

  courses: 'Курси',
  aboutUs: 'Про нас',
  contacts: 'Контакти',
  faq: 'Запитання й відповіді',
  proposals: 'Пропозиції',
  support: 'Підтримка',
  also: 'Також',
  logout: 'Вийти',
  signIn: 'Увійти',
  // tabs breadcrumb
  about: 'Про нас',
  'elementary English': 'Англійська для початкового рівня',
  'intermediate English': 'Англійська для середнього рівня',
  'advanced English': 'Англійська для високого рівня',

  'elementary German': 'Німецька для початкового рівня',
  'intermediate German': 'Німецька для середнього рівня',
  'advanced German': 'Німецька для високого рівня',

  'elementary Spain': 'Іспанська для початкового рівня',
  'intermediate Spain': 'Іспанська для середнього рівня',
  'advanced Spain': 'Іспанська для високого рівня',

  'elementary China': 'Китайська для початкового рівня',
  'intermediate China': 'Китайська для середнього рівня',
  'advanced China': 'Китайська для високого рівня',

  // reverse named
  'Англійська для початкового рівня': 'Англійська для початкового рівня',
  'Англійська для середнього рівня': 'Англійська для середнього рівня',
  'Англійська для високого рівня': 'Англійська для високого рівня',

  'Німецька для початкового рівня': 'Німецька для початкового рівня',
  'Німецька для середнього рівня': 'Німецька для середнього рівня',
  'Німецька для високого рівня': 'Німецька для високого рівня',

  'Іспанська для початкового рівня': 'Іспанська для початкового рівня',
  'Іспанська для середнього рівня': 'Іспанська для середнього рівня',
  'Іспанська для високого рівня': 'Іспанська для високого рівня',

  'Китайська для початкового рівня': 'Китайська для початкового рівня',
  'Китайська для середнього рівня': 'Китайська для середнього рівня',
  'Китайська для високого рівня': 'Китайська для високого рівня',

  FAQ: 'Запитання й відповіді',
  suggestions: 'Пропозиції',
  login: 'Увійти',
  registration: 'Реєстрація',
  admin: 'Адмін',
  personal: 'Особистий кабінет',
  reviews: 'Відгуки',
  payment: 'Умови оплати',
  policy: 'Політика',
  useragreement: 'Згода',
  //   Home page
  homeTitle: 'Онлайн-школа іноземних мов',
  homeSubTitle: 'Досягни своєї мети за допомогою кращих методик від носіів мов',
  tryToFree: 'Спробувати безкоштовно',
  homeCourseTitle: ' Курси іноземної мови для будь-якого рівня',
  homeCourseLessons: 'Занять:',
  homeCourseModules: 'Модулей:',
  'Дізнатись детальніше': 'Дізнатись детальніше',
  priceFrom: 'Від',
  uah: 'грн',
  allCourses: 'Всі курси',
  //  Home page  forWhomSection
  forWhom: 'Кому підійде?',
  forWhomSubtitle: ` підійде всім, хто
  хоче за короткий термін якісно змінити своє життя, освоївши іноземну
  мову.`,
  schoolchildren: 'Школярам',
  schoolchildrenDesc: 'Скласти випускні іспити або вступити до ВНЗ.',

  students: 'Студентам',
  studentsDesc:
    'Переїхати на навчання в іншу країну або знайти високооплачувану роботу',

  emigrant: 'Емігрантам',
  emigrantDesc:
    'Адаптуватися в новій країні, створити конкурентну перевагу та працевлаштуватися',

  comunicative: 'Комунікабельним',
  comunicativeDesc: `Створити щасливу сім'ю з іноземцем і інтегруватися в нове суспільство`,

  buisnes: 'Бізнесменам',
  buisnesDesc:
    'Завести полезные знакомства среди иностранцев и масштабировать бизнес',

  travel: 'Мандрівникам',
  travelDesc:
    'Вільно спілкуватися та знаходити нових друзів, вирішувати побутові питання та спірні ситуації',
};
